smooth_planner_api/app/controllers/api/v1/items_controller.rb

    def destroy
      @item = Item.find(params[:id])

      if @item.destroy
        # head :no_content, status: :ok
        temp_trip = @item.trip_id
        @trip = Trip.find(temp_trip)
        @items = @trip.items.order(:time_start)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 7]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."trip_id" = $1 ORDER BY "items"."time_start" ASC  [["trip_id", 2]]

    def create
      newitem = Item.new(item_params)
      puts item_params
      if newitem.save
        @trip = Trip.find(newitem.trip_id)
        @items = @trip.items.order(:time_start)
---
INSERT INTO "items" ("item_type", "details", "confirmation", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_type", "T"], ["details", "sdlghszid"], ["confirmation", "slkvz"], ["trip_id", 4], ["created_at", "2019-03-07 00:40:26.146294"], ["updated_at", "2019-03-07 00:40:26.146294"]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."trip_id" = $1 ORDER BY "items"."time_start" ASC  [["trip_id", 4]]

    def update
      item_to_update = Item.find(params[:id])
      item_to_update.update(item_params)
      if item_to_update.save
        @trip = Trip.find(item_to_update.trip_id)
        @items = @trip.items.order(:time_start)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "items" SET "details" = $1, "confirmation" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["details", "This better work. I have been doing this."], ["confirmation", "ABCDEF"], ["updated_at", "2019-03-09 03:42:57.009203"], ["id", 8]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."trip_id" = $1 ORDER BY "items"."time_start" ASC  [["trip_id", 2]]