smooth_planner_api/app/controllers/api/v1/itineraries_controller.rb

    def index
      @itineraries = Itinerary.all
---
SELECT "itineraries".* FROM "itineraries"

    def show
      @itinerary = Itinerary.find(params[:id])
      @items = @itinerary.items.order(:time_start)
---
SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."itinerary_id" = $1 ORDER BY "items"."time_start" ASC  [["itinerary_id", 3]]