smooth_planner_api/app/controllers/api/v1/trips_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."trip_id" = $1 ORDER BY "items"."time_start" ASC  [["trip_id", 1]]
---
    def show
      @trip = Trip.find(params[:id])
      @items = @trip.items.order(:time_start)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "trips" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "desi"], ["user_id", 1], ["created_at", "2019-03-06 21:54:55.246554"], ["updated_at", "2019-03-06 21:54:55.246554"]]
---
    def create
      @user = User.find(params[:user_id])
      newtrip = Trip.create(trip_params)

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 5]]
SELECT "trips".* FROM "trips" INNER JOIN "trips_users" ON "trips"."id" = "trips_users"."trip_id" WHERE "trips_users"."user_id" = $1 ORDER BY "trips"."time_start" ASC  [["user_id", 1]]
---
    def destroy
      trip = Trip.find(params[:id])
      user = User.find(params[:user])
      trip.destroy
      trip = user.trips.order(:time_start)

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "simone@user.com"]]
SELECT "users".* FROM "users" INNER JOIN "trips_users" ON "users"."id" = "trips_users"."user_id" WHERE "trips_users"."trip_id" = $1  [["trip_id", 2]]
---
    def update
      @trip = Trip.find(params[:id])
      @user = User.find_by(email: params[:email])
      @successful = [{ message: "User was successfully added" }]
      @unsuccessful = [{ message: "No user exists with that email so could not be added to this trip." }]
      if (@user && !(@trip.users.include?(@user)))