smooth_planner_api/app/controllers/api/v1/users_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1 ORDER BY "trips"."time_start" ASC  [["user_id", 1]]
---
    def show
      @trip = Trip.where(user_id: params[:id]).order(:time_start)